let words = [
  '海康威视',
  '字节跳动',
  '腾讯',
  '阿里巴巴',
  '美团',
  '百度',
  '京东',
  '网易',
  '滴滴出行',
  '小米',
  '哔哩哔哩',
  '快手',
  '新浪',
  '360',
  '爱奇艺',
  '搜狐',
  '搜狗',
  '58同城',
  '高德',
  '完美世界',
  '豆瓣',
  '去哪儿网',
  '知乎',
  '当当网',
  '雪球',
  '商汤科技',
  '好未来',
  '罗辑思维',
  '唱吧',
  '作业帮',
  '值得买',
  '猿辅导',
  '每日优鲜',
  '寒武纪',
  '微软',
  '亚马逊',
  'IBM',
  '拼多多',
  '哔哩哔哩',
  '饿了么',
  '盒马',
  '趣头条',
  '携程',
  '陆金所',
  '哈啰出行',
  '阅文',
  '喜马拉雅',
  '叮咚买菜',
  '虎扑网',
  '腾讯',
  '顺丰',
  '华为',
  '中兴',
  '大疆',
  '迅雷',
  '微众银行',
  '微信',
  '唯品会',
  '酷狗音乐',
  '小鹏汽车',
  '荔枝FM',
  '三七互娱',
  '阿里巴巴',
  '阿里云',
  '蚂蚁金服',
  '菜鸟',
  '花瓣',
  '同花顺'
]
// words = words.slice(0, 20)
words = words.slice(0, words.length)

const data = words.map(item => {
  const weight = Math.floor(Math.random() * 100)
  return [item + weight, weight]
})

console.log(data.map((item) => {
  return item[0] + ' ' + item[1]
}).join('\n'))

export default data
